module ApplicationHelper

	def self.get_column_code(column_name)
		code_hash = {
			"都、国、市町村" => 0,
			"管理番号" => 1,
			"シーン種別(1)" => 2,
			"シーン種別(2)" => 3,
			"保障種別(2)" => 4,
			"一般名称（今後増えてきたものにする）" => 5,
			"独自（都、国、市町村）の呼称" => 6,
			"保障額・保障内容" => 7,
			"対象の方" => 8,
			"年齢(以上)" => 9,
			"年齢(以下)" => 10,
			"年齢(偶数・奇数)" => 11,
			"女" => 12,
			"男" => 13,
			"Unnamed:14" => 14,
			"ひとり親" => 15,
			"妊婦(産前産後)" => 16,
			"Unnamed:17" => 17,
			"子供(1)乳児" => 18,
			"子供(2)就学前、保育園、幼稚園" => 19,
			"子供(3)小学生" => 20,
			"子供(4)中学生" => 21,
			"子供(5)高校生" => 22,
			"高齢者(1)前期高齢者対象" => 23,
			"高齢者(2)後期高齢者対象" => 24,
			"要介護者" => 25,
			"障がい者" => 26,
			"住宅・店舗" => 27,
			"URL(1)" => 28,
			"URL(2)" => 29,
			"URL(3)" => 30,
			"項目追加（1）" => 31,
			"項目追加（2）" => 32,
			"項目追加（3）" => 33
		}

		return code_hash[column_name].to_s.to_sym
	end

	def self.get_column_name(column_code)
		name_hash = {
			0 => "都、国、市町村",
			1 => "管理番号",
			2 => "シーン種別(1)",
			3 => "シーン種別(2)",
			4 => "保障種別(2)",
			5 => "一般名称（今後増えてきたものにする）",
			6 => "独自（都、国、市町村）の呼称",
			7 => "保障額・保障内容",
			8 => "対象の方",
			9 => "年齢(以上)",
			10 => "年齢(以下)",
			11 => "年齢(偶数・奇数)",
			12 => "女",
			13 => "男",
			14 => "Unnamed:14",
			15 => "ひとり親",
			16 => "妊婦(産前産後)",
			17 => "Unnamed:17",
			18 => "子供(1)乳児",
			19 => "子供(2)就学前、保育園、幼稚園",
			20 => "子供(3)小学生",
			21 => "子供(4)中学生",
			22 => "子供(5)高校生",
			23 => "高齢者(1)前期高齢者対象",
			24 => "高齢者(2)後期高齢者対象",
			25 => "要介護者",
			26 => "障がい者",
			27 => "住宅・店舗",
			28 => "URL(1)",
			29 => "URL(2)",
			30 => "URL(3)",
			31 => "項目追加（1）",
			32 => "項目追加（2）",
			33 => "項目追加（3）"
		}

		# for i, c in enumerate(df.columns): print 'rename_column :institutions, :"%s", :"%s" '%(c.replace(' ','').replace('\n', ''), i)

		return name_hash[column_code.to_s.to_sym]
	end
end
